#!/bin/bash
set -x
export WORK_DIR=$PWD
export NODELIST=(
    "10.192.23.158"
    "10.192.23.157"
    "10.192.23.142"
    "10.192.23.156"
    "10.192.23.154"
    "10.192.23.153"
    "10.192.23.155"
    "10.192.23.151"
    "10.192.23.150"
    "10.192.23.149"
    "10.192.23.148"
    "10.192.23.147"
    "10.192.23.146"
    "10.192.23.145"
    "10.192.23.144"
    "10.192.23.152"
    "10.192.23.141"
    "10.192.23.143"
)

echo "NODELIST: ${NODELIST[*]}"

# 运行检查脚本
for node in "${NODELIST[@]}"; do
    echo "Checking $node..."
    ssh $node "timeout 60 bash $WORK_DIR/checker.sh"
done
